[
  {
    "job": "Buildings and More - Frontend Engineer",
    "jobDesc": "",
    "list1": "- I developed and implemented over 100 user interfaces using HTML, CSS, Bootstrap and Nuxt Js by translating prototypes",
    "list2": "- Implemented  dynamic meta tags strategy, optimizing SEO performance and  ensuring each page had relevant and accurate meta information, leading to increase in organic search traffic.",
    "list3": "- I identified and resolved a critical bug in the Axios interceptor responsible for appending authentication tokens to outgoing API requests.",
    "list4": "- Integrated API calls with Axios to efficiently retrieve and display dynamic content on the user interface, optimizing data fetching and ensuring real-time updates for users.",

    "jobdate": "Februray 2022 - Present"
  },
  {
    "job": "Bitsin - Frontend Engineer",
    "jobDesc": "This is a  hotel, and flight booking engine, that was built with Nuxt js , Bootstrap , VueBootstrap, css. ",
    "list1": "- Successfully resolved a critical authentication bug that was causing user login failures, improving the overall user experience and boosting user trust and satisfaction..",
    "list2": "- Implemented Vuex for state management, ensuring consistent and efficient handling of application data across various components.",
    "list3": "- I worked closely with the backend developers to consume API endpoints using Axios, ensuring seamless communication within the team..",
    "list4": "- I utilized bootstrap's grid system and pre-built components, which  led to a significant reduction in development time and ensured a consistently responsive design across various devices and screen sizes .",

    "jobdate": "October 2022 - November 2022"
  },

  {
    "job": "House-finder - Frontend Engineer ",
    "jobDesc": "",
    "list1": "- I implemented a robust state management system utilizing Vuex that handled the application state efficiently and also improved the maintainability and scalability of the code",
    "list2": "- Utilized Vue Router to enable seamless navigation and dynamic page loading.",
    "list3": "- implemented lazy loading for images and assets, resulting in a significant reduction in initial page load times and improving overall site performance.",
    "list4": "- Worked closely with the design team to translate visual mockups into interactive web applications.",

    "jobdate": "January 2022 - June 2022"
  },

  {
    "job": "Raadaa Partners intl. limited. - Frontend Engineer",
    "jobDesc": "",
    "list1": "- Provided instruction in front-end web development, including HTML, CSS, and JavaScript, and created supplementary instructional materials in the form of video tutorials to assist in the pupils' understanding.",
    "list2": "- led training on the use of Visual Studio Code as a development tool.",
    "jobdate": "September 2020 -December  2021"
  }
]
