[
  {
    "job": "Protraina , USA ",
    "jobDesc": "Backend Developer | Team Lead (Laravel, DigitalOcean, Firebase, FCM, MySQL, Laravel Scheduler e.t.c)",
    "list": [
      "- Led the backend development of a real-time booking system for trainers and trainees using Laravel.",
      "- Designed and implemented role-based access control (RBAC) for secure authorization.",
      "- Developed a referral and points system to incentivize user engagement and bookings.",
      "- Implemented real-time chat functionality with Firebase cloud messaging for seamless trainer-trainee communication.",
      "- Integrated Firebase authentication (Kreait) for secure user login and registration.",
      "- Set up and managed a DigitalOcean droplet for server deployment, optimizing performance and security.",
      "- Developed API endpoints for mobile (Flutter) , ensuring efficient data exchange.",
      "- Implemented Firebase Cloud Messaging (FCM) for real-time push notifications.",
      "- Created and optimized database schemas, caching strategies, and background jobs with Laravel Schedule",
      "- Engineered a seamless payment infrastructure by integrating Stripe, enabling trainers to securely withdraw funds, link payment methods, and receive automated payouts, while leveraging webhooks to ensure real-time transaction updates.",
      "- Designed and developed robust admin panel APIs, empowering administrators with full control over user management, booking workflows, financial transactions, and system configurations, ensuring operational efficiency and scalability."
    ],

    "jobdate": "March 2024 - Present"
  },
  {
    "job": "Buildings and More Nig.Ltd ",
    "jobDesc": "Frontend Engineer (Nuxt , Bootstrap ,Vuex ,css , Mixins)",
    "list": [
      "- Managed API interactions with Axios, ensuring efficient data retrieval and real-time updates on the user interface.",
      "- Designed and implemented a search bar with real-time suggestions, significantly enhancing search accuracy for products , professionals and handyman services",
      "- Utilized lazy loading to improve page load times and overall application performance.",
      "- Implemented an OTP interface with functionality to resend OTPs upon expiration, making use of async/await for this feature .",
      "- Developed a document upload form that efficiently handles image uploads, enhancing user experience like vendors to upload products , professionals and handymen to upload portfolios ."
    ],

    "jobdate": "Feb 2022 - Feb 2024"
  },
  {
    "job": "Ojastore Nig.Ltd ",
    "jobDesc": "Full Stack Developer (Vue3 , Tailwind ,Laravel ,Pinia)",
    "list": [
      "- Utilized Pinia for state management, composables for reusable logic, and a component-based architecture to ensure maintainable and scalable code",
      "- Designed and optimized database schemas, managed data migrations, and implemented caching strategies for improved performance .",
      "- Managed API interactions with Axios, ensuring efficient data retrieval and real-time updates on the user interface, and used slots for flexible component designs .",
      "- Developed RESTful APIs using Laravel, including authentication with Laravel Sanctum, and documented these APIs using Postman .",
      "- Integrated third-party services and APIs, such as payment gateways like Paystack.",
      "- Developed an intuitive product search and filtering system, enabling users to easily find products based on categories, pricing, and availability",
      "- Integrated a review and rating system, allowing customers to provide feedback on products and vendors",
      "- Implemented role-based access control (RBAC) to manage permissions for customers, vendors, and admins."
    ],

    "jobdate": "March 2023 – June 2023"
  },
  {
    "job": "Quick Collect ,Canada ",
    "jobDesc": "Front-end Developer (Vue3 , Tailwind, Pinia)",
    "list": [
      "- Worked in a team to implement complex user interfaces, ensuring alignment with project requirements and UX/UI guidelines.",
      "- Managed API interactions with Axios, ensuring efficient data retrieval and real-time updates on the user interface, and used slots for flexible component designs .",
      "- Utilized composables to efficiently share and reuse common functionalities across multiple Vue components, ensuring code reusability and maintainability .",
      "- Utilized Pinia for state management, composables for reusable logic, and a component-based architecture to ensure maintainable and scalable code."
    ],

    "jobdate": "April 2022 – June 2022"
  },
  {
    "job": "House Finder , Abuja , Nigeria",
    "jobDesc": "Frontend Engineer (Vue3, Tailwind ,Vuex ,Axios ,Javascript , css)",
    "list": [
      "- Developed an advanced search filter allowing users to filter properties by various categories such as rent, sale, property types",
      "- Implemented preloaders and lazy loading techniques on the website to enhance user experience and reduce load times.",
      "- During this period I worked closely with the backend developer to deliver an application that meets users needs in terms of the experience and also worked closely with UI/UX designer to implement designs that are both visually appealing and functionally effective.",
      "- Developed reusable, scalable components that maintained consistency throughout the application while significantly reducing development time",
      "- Utilized Tailwind CSS alongside traditional CSS to create responsive and mobile-first designs, ensuring optimal user experience across various devices "
    ],

    "jobdate": "June 2021 -January 2022"
  },

  {
    "job": "Raadaa Partners intl. limited, Abuja, Nigeria",
    "jobDesc": "Front-End Development Tutor",
    "list": [
      "- Mentored students through hands-on projects, increasing their understanding of front-end technologies and best practices . ",
      "- Utilized a project-based learning approach to engage students and reinforce practical skills in web development.",
      "- Developed and delivered instructional materials on front-end development, including HTML, CSS, and JavaScript, to students "
    ],
    "jobdate": "September 2020 – April 2021"
  }
]
